#ifndef _GETCONFIGFROMTEXT__H_
#define _GETCONFIGFROMTEXT__H_

#include <stdio.h>
#include <string.h>

#define LINE_MAX_LENGTH 256 //每行最大字符数
#define NAME_MAX_LENGTH 40 //每个参数名最大字符数
#define VALUE_MAX_LENGTH 40 //每个参数值最大字符数

/***************************************************************************/
/* 从配置文件中读取单独一个参数对应的值                                    */
/* 参数：1,配置文件路径; 2,匹配名称; 3,输出存储空间                        */
/* 返回：0,未找到; 1,找到符合名称的值                                      */
/***************************************************************************/
int GetConfigValue(char *conf_path,char *conf_name,char *config_buff);
/***************************************************************************/
/* 从配置文件中依次读取所有参数对应的值                                    */
/* 参数：1,配置文件路径; 2,输出存储空间; 3,参数个数                        */
/* 返回：0,有错误(读文件错误;从文件读取的参数个数小于设定要读取的参数个数);*/
/*       1,读取配置成功                                                    */
/***************************************************************************/
int GetAllConfig(char *conf_path,char *config_buff,int param_num);

#endif
